
# Box plot의 정의와 의미를 이해 ?
### 9. Box plot의 정의와 의미를 이해 ?  -------
# 상자그림 설명
# 상자그림                값                  설명
# 상자아래 세로점선       아랫수염            하위 0-25% 내에 해당하는 값
# 상자밑면                1사분위수(Q1)       하위 25% 위치값
# 상자내 굵은 선          2사분위수(Q2)       하위 50% 위치값(중앙값) Median은 중간값으로 샘플들의 값들의 중간값을 의미합니다
# 상자윗면                3사분위수(Q3)       하위 75% 위치값
# 상자 위 세로 점선       윗수염              하위 75-100% 내에 해당하는 값
# 상자 밖 가로선          극단치 경계         Q1, Q3 밖 1.5 IQR 내 최댓값
# 상자 밖 점 표식         극단치              Q1, Q3 밖 1.5 IQR를 벅어난 값

# 1.5 IQR : 4분위 범위(Q1-Q3 간 거리)의 1.5배
#최댓값, 최솟값, 중앙값, 사분편차를 사용하여 자료의 측정값들이 어떤 모양으로 분포되어 있으며, 
#극단값들은 어떠한지 등을 쉽게 알 수 있도록 하는 그림이다



# 빅데이터 분석이란 ?
#소셜 빅데이터, 실시간 사물지능통신(M2M：Machine to Machine) 센서 데이터, 기업 고객관계 데이터 등 
#도처에 존재하는 다양한 성격의빅데이터를 효과적으로 분석하는 것을 말한다
#데이터베이스 관리 도구로 데이터를 수집, 저장, 관리, 분석할 수 있는 역량을 넘어서는 대량의 정형 또는 
#비정형 데이터 집합과 이러한 데이터로부터 가치를 추출하고 결과를 분석하는 기술을 총칭한다.
#빅데이터(big data)란 대규모, 빠른 생성 속도, 다양한 형태라는 특징을 가진, 기존의 정보 관리 기술로는 저장/관리/분석하기 
#어려울 정도의 큰 규모의 정형 또는 비정형 데이터를 의미한다. 또한 그러한 데이터를 저장/관리/분석하는 기술도 빅데이터라는
#개념에 포괄된다. 빅데이터 현상은 기업들의 고객 데이터 수집 활동 및 멀티미디어 콘텐츠의 폭발적 증가와 스마트폰 보급, 
#SNS 활성화 및 사물 통신망의 저변 확대로 빠르게 확산되고 있다. 
#특히 기업들은 온라인/오프라인 사용자 정보, 소비자 행태에 대한 정보 수집, 적극적 고객 관련 정보 수집의 증가로 더 많은 
#데이터 스토리지와 정교한 분석 능력을 필요로 한다. 예를 들면 영국의 대형 유통 업체인 테스코(Tesco)는 매달 15억 건 
#이상의 (고객) 데이터를 수집하고, 고객의 소비 행태에 대한 대량의 데이터를 분석해 고객 맞춤형 서비스를 제공한다. 
#고객은 이제 무엇을 살지 고민하지 않아도 된다. 유통업체가 고객이 필요한 것, 좋아하는 패턴, 냉장고 속의 상황을 판단해서 
#모든 것을 알려주는 것이다. 


